tiiuae/nuttx/arch/arm/src/stm32n6/hardware/stm32n6xxx_xspi.h
/****************************************************************************
 * arch/arm/src/stm32n6/hardware/stm32n6xxx_xspi.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32N6_HARDWARE_STM32N6XXX_XSPI_H
#define __ARCH_ARM_SRC_STM32N6_HARDWARE_STM32N6XXX_XSPI_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "stm32n6xxx_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define STM32_XSPI_CR_OFFSET         0x0000 /* Control register */
#define STM32_XSPI_DCR1_OFFSET       0x0008 /* Device configuration 1 */
#define STM32_XSPI_DCR2_OFFSET       0x000c /* Device configuration 2 */
#define STM32_XSPI_DCR3_OFFSET       0x0010 /* Device configuration 3 */
#define STM32_XSPI_DCR4_OFFSET       0x0014 /* Device configuration 4 */
#define STM32_XSPI_SR_OFFSET         0x0020 /* Status register */
#define STM32_XSPI_FCR_OFFSET        0x0024 /* Flag clear register */
#define STM32_XSPI_DLR_OFFSET        0x0040 /* Data length register */
#define STM32_XSPI_AR_OFFSET         0x0048 /* Address register */
#define STM32_XSPI_DR_OFFSET         0x0050 /* Data register */
#define STM32_XSPI_PSMKR_OFFSET      0x0080 /* Polling status mask */
#define STM32_XSPI_PSMAR_OFFSET      0x0088 /* Polling status match */
#define STM32_XSPI_PIR_OFFSET        0x0090 /* Polling interval */
#define STM32_XSPI_CCR_OFFSET        0x0100 /* Communication configuration */
#define STM32_XSPI_TCR_OFFSET        0x0108 /* Timing configuration */
#define STM32_XSPI_IR_OFFSET         0x0110 /* Instruction register */
#define STM32_XSPI_ABR_OFFSET        0x0120 /* Alternate bytes register */
#define STM32_XSPI_LPTR_OFFSET       0x0130 /* Low-power timeout */
#define STM32_XSPI_WPCCR_OFFSET      0x0140 /* Wrap communication config */
#define STM32_XSPI_WPTCR_OFFSET      0x0148 /* Wrap timing config */
#define STM32_XSPI_WPIR_OFFSET       0x0150 /* Wrap instruction */
#define STM32_XSPI_WPABR_OFFSET      0x0160 /* Wrap alternate bytes */
#define STM32_XSPI_WCCR_OFFSET       0x0180 /* Write communication config */
#define STM32_XSPI_WTCR_OFFSET       0x0188 /* Write timing config */
#define STM32_XSPI_WIR_OFFSET        0x0190 /* Write instruction */
#define STM32_XSPI_WABR_OFFSET       0x01a0 /* Write alternate bytes */
#define STM32_XSPI_HLCR_OFFSET       0x0200 /* HyperBus latency config */
#define STM32_XSPI_CALFCR_OFFSET     0x0210 /* Full-cycle calibration */
#define STM32_XSPI_CALMR_OFFSET      0x0218 /* Master calibration */
#define STM32_XSPI_CALSOR_OFFSET     0x0220 /* Output calibration */
#define STM32_XSPI_CALSIR_OFFSET     0x0228 /* Input calibration */

#define STM32_XSPIM_CR_OFFSET        0x0000 /* XSPIM control */

/* Register Addresses *******************************************************/

#define STM32_XSPI1_CR               (STM32_XSPI1_BASE + STM32_XSPI_CR_OFFSET)
#define STM32_XSPI1_DCR1             (STM32_XSPI1_BASE + STM32_XSPI_DCR1_OFFSET)
#define STM32_XSPI1_DCR2             (STM32_XSPI1_BASE + STM32_XSPI_DCR2_OFFSET)
#define STM32_XSPI1_DCR3             (STM32_XSPI1_BASE + STM32_XSPI_DCR3_OFFSET)
#define STM32_XSPI1_DCR4             (STM32_XSPI1_BASE + STM32_XSPI_DCR4_OFFSET)
#define STM32_XSPI1_SR               (STM32_XSPI1_BASE + STM32_XSPI_SR_OFFSET)
#define STM32_XSPI1_FCR              (STM32_XSPI1_BASE + STM32_XSPI_FCR_OFFSET)
#define STM32_XSPI1_DLR              (STM32_XSPI1_BASE + STM32_XSPI_DLR_OFFSET)
#define STM32_XSPI1_AR               (STM32_XSPI1_BASE + STM32_XSPI_AR_OFFSET)
#define STM32_XSPI1_DR               (STM32_XSPI1_BASE + STM32_XSPI_DR_OFFSET)
#define STM32_XSPI1_PSMKR            (STM32_XSPI1_BASE + STM32_XSPI_PSMKR_OFFSET)
#define STM32_XSPI1_PSMAR            (STM32_XSPI1_BASE + STM32_XSPI_PSMAR_OFFSET)
#define STM32_XSPI1_PIR              (STM32_XSPI1_BASE + STM32_XSPI_PIR_OFFSET)
#define STM32_XSPI1_CCR              (STM32_XSPI1_BASE + STM32_XSPI_CCR_OFFSET)
#define STM32_XSPI1_TCR              (STM32_XSPI1_BASE + STM32_XSPI_TCR_OFFSET)
#define STM32_XSPI1_IR               (STM32_XSPI1_BASE + STM32_XSPI_IR_OFFSET)
#define STM32_XSPI1_ABR              (STM32_XSPI1_BASE + STM32_XSPI_ABR_OFFSET)
#define STM32_XSPI1_LPTR             (STM32_XSPI1_BASE + STM32_XSPI_LPTR_OFFSET)
#define STM32_XSPI1_WPCCR            (STM32_XSPI1_BASE + STM32_XSPI_WPCCR_OFFSET)
#define STM32_XSPI1_WPTCR            (STM32_XSPI1_BASE + STM32_XSPI_WPTCR_OFFSET)
#define STM32_XSPI1_WPIR             (STM32_XSPI1_BASE + STM32_XSPI_WPIR_OFFSET)
#define STM32_XSPI1_WPABR            (STM32_XSPI1_BASE + STM32_XSPI_WPABR_OFFSET)
#define STM32_XSPI1_WCCR             (STM32_XSPI1_BASE + STM32_XSPI_WCCR_OFFSET)
#define STM32_XSPI1_WTCR             (STM32_XSPI1_BASE + STM32_XSPI_WTCR_OFFSET)
#define STM32_XSPI1_WIR              (STM32_XSPI1_BASE + STM32_XSPI_WIR_OFFSET)
#define STM32_XSPI1_WABR             (STM32_XSPI1_BASE + STM32_XSPI_WABR_OFFSET)
#define STM32_XSPI1_HLCR             (STM32_XSPI1_BASE + STM32_XSPI_HLCR_OFFSET)
#define STM32_XSPI1_CALFCR           (STM32_XSPI1_BASE + STM32_XSPI_CALFCR_OFFSET)
#define STM32_XSPI1_CALMR            (STM32_XSPI1_BASE + STM32_XSPI_CALMR_OFFSET)
#define STM32_XSPI1_CALSOR           (STM32_XSPI1_BASE + STM32_XSPI_CALSOR_OFFSET)
#define STM32_XSPI1_CALSIR           (STM32_XSPI1_BASE + STM32_XSPI_CALSIR_OFFSET)

#define STM32_XSPI2_CR               (STM32_XSPI2_BASE + STM32_XSPI_CR_OFFSET)
#define STM32_XSPI2_DCR1             (STM32_XSPI2_BASE + STM32_XSPI_DCR1_OFFSET)
#define STM32_XSPI2_DCR2             (STM32_XSPI2_BASE + STM32_XSPI_DCR2_OFFSET)
#define STM32_XSPI2_DCR3             (STM32_XSPI2_BASE + STM32_XSPI_DCR3_OFFSET)
#define STM32_XSPI2_DCR4             (STM32_XSPI2_BASE + STM32_XSPI_DCR4_OFFSET)
#define STM32_XSPI2_SR               (STM32_XSPI2_BASE + STM32_XSPI_SR_OFFSET)
#define STM32_XSPI2_FCR              (STM32_XSPI2_BASE + STM32_XSPI_FCR_OFFSET)
#define STM32_XSPI2_DLR              (STM32_XSPI2_BASE + STM32_XSPI_DLR_OFFSET)
#define STM32_XSPI2_AR               (STM32_XSPI2_BASE + STM32_XSPI_AR_OFFSET)
#define STM32_XSPI2_DR               (STM32_XSPI2_BASE + STM32_XSPI_DR_OFFSET)
#define STM32_XSPI2_PSMKR            (STM32_XSPI2_BASE + STM32_XSPI_PSMKR_OFFSET)
#define STM32_XSPI2_PSMAR            (STM32_XSPI2_BASE + STM32_XSPI_PSMAR_OFFSET)
#define STM32_XSPI2_PIR              (STM32_XSPI2_BASE + STM32_XSPI_PIR_OFFSET)
#define STM32_XSPI2_CCR              (STM32_XSPI2_BASE + STM32_XSPI_CCR_OFFSET)
#define STM32_XSPI2_TCR              (STM32_XSPI2_BASE + STM32_XSPI_TCR_OFFSET)
#define STM32_XSPI2_IR               (STM32_XSPI2_BASE + STM32_XSPI_IR_OFFSET)
#define STM32_XSPI2_ABR              (STM32_XSPI2_BASE + STM32_XSPI_ABR_OFFSET)
#define STM32_XSPI2_LPTR             (STM32_XSPI2_BASE + STM32_XSPI_LPTR_OFFSET)
#define STM32_XSPI2_WPCCR            (STM32_XSPI2_BASE + STM32_XSPI_WPCCR_OFFSET)
#define STM32_XSPI2_WPTCR            (STM32_XSPI2_BASE + STM32_XSPI_WPTCR_OFFSET)
#define STM32_XSPI2_WPIR             (STM32_XSPI2_BASE + STM32_XSPI_WPIR_OFFSET)
#define STM32_XSPI2_WPABR            (STM32_XSPI2_BASE + STM32_XSPI_WPABR_OFFSET)
#define STM32_XSPI2_WCCR             (STM32_XSPI2_BASE + STM32_XSPI_WCCR_OFFSET)
#define STM32_XSPI2_WTCR             (STM32_XSPI2_BASE + STM32_XSPI_WTCR_OFFSET)
#define STM32_XSPI2_WIR              (STM32_XSPI2_BASE + STM32_XSPI_WIR_OFFSET)
#define STM32_XSPI2_WABR             (STM32_XSPI2_BASE + STM32_XSPI_WABR_OFFSET)
#define STM32_XSPI2_HLCR             (STM32_XSPI2_BASE + STM32_XSPI_HLCR_OFFSET)
#define STM32_XSPI2_CALFCR           (STM32_XSPI2_BASE + STM32_XSPI_CALFCR_OFFSET)
#define STM32_XSPI2_CALMR            (STM32_XSPI2_BASE + STM32_XSPI_CALMR_OFFSET)
#define STM32_XSPI2_CALSOR           (STM32_XSPI2_BASE + STM32_XSPI_CALSOR_OFFSET)
#define STM32_XSPI2_CALSIR           (STM32_XSPI2_BASE + STM32_XSPI_CALSIR_OFFSET)

#define STM32_XSPIM_CR               (STM32_XSPIM_BASE + STM32_XSPIM_CR_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Control register *********************************************************/

#define XSPI_CR_EN                   (1 << 0)  /* XSPI enable */
#define XSPI_CR_ABORT                (1 << 1)  /* Abort request */
#define XSPI_CR_DMAEN                (1 << 2)  /* DMA enable */
#define XSPI_CR_TCEN                 (1 << 3)  /* Timeout enable */
#define XSPI_CR_DMM                  (1 << 6)  /* Dual-memory mode */
#define XSPI_CR_FTHRES_SHIFT         (8)       /* FIFO threshold level */
#define XSPI_CR_FTHRES_MASK          (31 << XSPI_CR_FTHRES_SHIFT)
#  define XSPI_CR_FTHRES(n)          (((n) - 1) << XSPI_CR_FTHRES_SHIFT)
#define XSPI_CR_TEIE                 (1 << 16) /* Transfer-error interrupt */
#define XSPI_CR_TCIE                 (1 << 17) /* Transfer-complete interrupt */
#define XSPI_CR_FTIE                 (1 << 18) /* FIFO-threshold interrupt */
#define XSPI_CR_SMIE                 (1 << 19) /* Status-match interrupt */
#define XSPI_CR_TOIE                 (1 << 20) /* Timeout interrupt */
#define XSPI_CR_APMS                 (1 << 22) /* Automatic-polling stop */
#define XSPI_CR_PMM                  (1 << 23) /* Polling match mode */
#define XSPI_CR_CSSEL                (1 << 24) /* Chip-select selection */
#define XSPI_CR_FMODE_SHIFT          (28)      /* Functional mode */
#define XSPI_CR_FMODE_MASK           (3 << XSPI_CR_FMODE_SHIFT)
#  define XSPI_CR_FMODE_WRITE        (0 << XSPI_CR_FMODE_SHIFT)
#  define XSPI_CR_FMODE_READ         (1 << XSPI_CR_FMODE_SHIFT)
#  define XSPI_CR_FMODE_POLLING      (2 << XSPI_CR_FMODE_SHIFT)
#  define XSPI_CR_FMODE_MEMORY       (3 << XSPI_CR_FMODE_SHIFT)
#define XSPI_CR_MSEL_SHIFT           (30)      /* Memory select */
#define XSPI_CR_MSEL_MASK            (3 << XSPI_CR_MSEL_SHIFT)

