tiiuae/nuttx/arch/arm/src/stm32n6/hardware/stm32n6xxx_xspi.h
/* Device configuration registers *******************************************/

#define XSPI_DCR1_CKMODE             (1 << 0) /* Clock mode 3 */
#define XSPI_DCR1_FRCK               (1 << 1) /* Free-running clock */
#define XSPI_DCR1_CSHT_SHIFT         (8)      /* Chip-select high time */
#define XSPI_DCR1_CSHT_MASK          (0x3f << XSPI_DCR1_CSHT_SHIFT)
#  define XSPI_DCR1_CSHT(n)          (((n) - 1) << XSPI_DCR1_CSHT_SHIFT)
#define XSPI_DCR1_DEVSIZE_SHIFT      (16)     /* Device size */
#define XSPI_DCR1_DEVSIZE_MASK       (31 << XSPI_DCR1_DEVSIZE_SHIFT)
#  define XSPI_DCR1_DEVSIZE(n)       ((n) << XSPI_DCR1_DEVSIZE_SHIFT)
#define XSPI_DCR1_MTYP_SHIFT         (24)     /* Memory type */
#define XSPI_DCR1_MTYP_MASK          (7 << XSPI_DCR1_MTYP_SHIFT)
#  define XSPI_DCR1_MTYP(n)          ((n) << XSPI_DCR1_MTYP_SHIFT)

#define XSPI_DCR2_PRESCALER_SHIFT    (0)  /* Clock prescaler */
#define XSPI_DCR2_PRESCALER_MASK     (0xff << XSPI_DCR2_PRESCALER_SHIFT)
#  define XSPI_DCR2_PRESCALER(n)     ((n) << XSPI_DCR2_PRESCALER_SHIFT)
#define XSPI_DCR2_WRAPSIZE_SHIFT     (16) /* Wrap size */
#define XSPI_DCR2_WRAPSIZE_MASK      (7 << XSPI_DCR2_WRAPSIZE_SHIFT)
#  define XSPI_DCR2_WRAPSIZE(n)      ((n) << XSPI_DCR2_WRAPSIZE_SHIFT)

#define XSPI_DCR3_MAXTRAN_SHIFT      (0)  /* Maximum transfer */
#define XSPI_DCR3_MAXTRAN_MASK       (0xff << XSPI_DCR3_MAXTRAN_SHIFT)
#  define XSPI_DCR3_MAXTRAN(n)       ((n) << XSPI_DCR3_MAXTRAN_SHIFT)
#define XSPI_DCR3_CSBOUND_SHIFT      (16) /* CS boundary */
#define XSPI_DCR3_CSBOUND_MASK       (31 << XSPI_DCR3_CSBOUND_SHIFT)
#  define XSPI_DCR3_CSBOUND(n)       ((n) << XSPI_DCR3_CSBOUND_SHIFT)

#define XSPI_DCR4_REFRESH_SHIFT      (0) /* Refresh rate */
#define XSPI_DCR4_REFRESH_MASK       (0xffffffff << XSPI_DCR4_REFRESH_SHIFT)
#  define XSPI_DCR4_REFRESH(n)       ((n) << XSPI_DCR4_REFRESH_SHIFT)

/* Status and flag clear registers ******************************************/

#define XSPI_SR_TEF                  (1 << 0) /* Transfer error */
#define XSPI_SR_TCF                  (1 << 1) /* Transfer complete */
#define XSPI_SR_FTF                  (1 << 2) /* FIFO threshold */
#define XSPI_SR_SMF                  (1 << 3) /* Status match */
#define XSPI_SR_TOF                  (1 << 4) /* Timeout */
#define XSPI_SR_BUSY                 (1 << 5) /* Busy */
#define XSPI_SR_FLEVEL_SHIFT         (8)      /* FIFO level */
#define XSPI_SR_FLEVEL_MASK          (0x3f << XSPI_SR_FLEVEL_SHIFT)

#define XSPI_FCR_CTEF                (1 << 0) /* Clear transfer error */
#define XSPI_FCR_CTCF                (1 << 1) /* Clear transfer complete */
#define XSPI_FCR_CSMF                (1 << 3) /* Clear status match */
#define XSPI_FCR_CTOF                (1 << 4) /* Clear timeout */
#define XSPI_FCR_ALL                 (XSPI_FCR_CTEF | XSPI_FCR_CTCF | XSPI_FCR_CSMF | XSPI_FCR_CTOF)

/* Data, address and polling registers **************************************/

#define XSPI_DLR_DL_SHIFT            (0) /* Data length */
#define XSPI_DLR_DL_MASK             (0xffffffff << XSPI_DLR_DL_SHIFT)
#define XSPI_AR_ADDRESS_SHIFT        (0) /* Address */
#define XSPI_AR_ADDRESS_MASK         (0xffffffff << XSPI_AR_ADDRESS_SHIFT)
#define XSPI_DR_DATA_SHIFT           (0) /* Data */
#define XSPI_DR_DATA_MASK            (0xffffffff << XSPI_DR_DATA_SHIFT)
#define XSPI_PSMKR_MASK_SHIFT        (0) /* Status mask */
#define XSPI_PSMKR_MASK_MASK         (0xffffffff << XSPI_PSMKR_MASK_SHIFT)
#define XSPI_PSMAR_MATCH_SHIFT       (0) /* Status match */
#define XSPI_PSMAR_MATCH_MASK        (0xffffffff << XSPI_PSMAR_MATCH_SHIFT)
#define XSPI_PIR_INTERVAL_SHIFT      (0) /* Polling interval */
#define XSPI_PIR_INTERVAL_MASK       (0xffff << XSPI_PIR_INTERVAL_SHIFT)
#  define XSPI_PIR_INTERVAL(n)       ((n) << XSPI_PIR_INTERVAL_SHIFT)

/* Communication and timing registers ***************************************/

#define XSPI_CCR_IMODE_SHIFT         (0)       /* Instruction mode */
#define XSPI_CCR_IMODE_MASK          (7 << XSPI_CCR_IMODE_SHIFT)
#  define XSPI_CCR_IMODE(n)          ((n) << XSPI_CCR_IMODE_SHIFT)
#define XSPI_CCR_IDTR                (1 << 3)  /* Instruction DTR */
#define XSPI_CCR_ISIZE_SHIFT         (4)       /* Instruction size */
#define XSPI_CCR_ISIZE_MASK          (3 << XSPI_CCR_ISIZE_SHIFT)
#  define XSPI_CCR_ISIZE(n)          ((n) << XSPI_CCR_ISIZE_SHIFT)
#define XSPI_CCR_ADMODE_SHIFT        (8)       /* Address mode */
#define XSPI_CCR_ADMODE_MASK         (7 << XSPI_CCR_ADMODE_SHIFT)
#  define XSPI_CCR_ADMODE(n)         ((n) << XSPI_CCR_ADMODE_SHIFT)
#define XSPI_CCR_ADDTR               (1 << 11) /* Address DTR */
#define XSPI_CCR_ADSIZE_SHIFT        (12)      /* Address size */
#define XSPI_CCR_ADSIZE_MASK         (3 << XSPI_CCR_ADSIZE_SHIFT)
#  define XSPI_CCR_ADSIZE(n)         ((n) << XSPI_CCR_ADSIZE_SHIFT)
#define XSPI_CCR_ABMODE_SHIFT        (16)      /* Alternate bytes mode */
#define XSPI_CCR_ABMODE_MASK         (7 << XSPI_CCR_ABMODE_SHIFT)
#  define XSPI_CCR_ABMODE(n)         ((n) << XSPI_CCR_ABMODE_SHIFT)
#define XSPI_CCR_ABDTR               (1 << 19) /* Alternate bytes DTR */
#define XSPI_CCR_ABSIZE_SHIFT        (20)      /* Alternate bytes size */
#define XSPI_CCR_ABSIZE_MASK         (3 << XSPI_CCR_ABSIZE_SHIFT)
#  define XSPI_CCR_ABSIZE(n)         ((n) << XSPI_CCR_ABSIZE_SHIFT)
#define XSPI_CCR_DMODE_SHIFT         (24)      /* Data mode */
#define XSPI_CCR_DMODE_MASK          (7 << XSPI_CCR_DMODE_SHIFT)
#  define XSPI_CCR_DMODE(n)          ((n) << XSPI_CCR_DMODE_SHIFT)
#define XSPI_CCR_DDTR                (1 << 27) /* Data DTR */
#define XSPI_CCR_DQSE                (1 << 29) /* DQS enable */

#define XSPI_TCR_DCYC_SHIFT          (0)       /* Dummy cycles */
#define XSPI_TCR_DCYC_MASK           (31 << XSPI_TCR_DCYC_SHIFT)
#  define XSPI_TCR_DCYC(n)           ((n) << XSPI_TCR_DCYC_SHIFT)
#define XSPI_TCR_SSHIFT              (1 << 30) /* Sample shift */

#define XSPI_IR_INSTRUCTION_SHIFT    (0) /* Instruction */
#define XSPI_IR_INSTRUCTION_MASK     (0xffffffff << XSPI_IR_INSTRUCTION_SHIFT)
#define XSPI_ABR_ALTERNATE_SHIFT     (0) /* Alternate bytes */
#define XSPI_ABR_ALTERNATE_MASK      (0xffffffff << XSPI_ABR_ALTERNATE_SHIFT)
#define XSPI_LPTR_TIMEOUT_SHIFT      (0) /* Timeout period */
#define XSPI_LPTR_TIMEOUT_MASK       (0xffff << XSPI_LPTR_TIMEOUT_SHIFT)
#  define XSPI_LPTR_TIMEOUT(n)       ((n) << XSPI_LPTR_TIMEOUT_SHIFT)

/* Wrap communication and timing registers **********************************/

